SUBJECTS['حيا 102']={
 units:[
  {name:'الوحدة الأولى: دراسة الحياة',
   lessons:[['1-1','مدخل إلى علم الأحياء'],['1-2','طبيعة العلم وطرائقه']],
   test:[]},
  {name:'الوحدة الثانية: تنظيم تنوع الحياة',
   lessons:[['2-1','تاريخ التصنيف'],['2-2','التصنيف الحديث']],
   test:[]},
  {name:'الوحدة الثالثة: البكتيريا والفيروسات',
   lessons:[['3-1','البكتيريا'],['3-2','الفيروسات والبريونات']],
   test:[]},
  {name:'الوحدة الرابعة: تكاثر الإنسان ونموه',
   lessons:[['4-1','جهازا التكاثر في الإنسان'],['4-2','نمو الجنين والولادة والهرم']],
   test:[]}
 ],
 lessons:{}
};

/* لإضافة درس: */
// SUBJECTS['حيا 102'].lessons['1-1']={goals:[...],cards:[...],questions:[...]};
